app/views/home/index.html.erb

SELECT COUNT(*) FROM "questions"
---
		<br>
		<div id="count"><%= Question.count %> people have questions.&nbsp;