app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions"
---
  def show
    @questions = Question.all

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 1]]
---
  def index
  	@question = Question.find(params[:id])

INSERT INTO "questions" ("ministry", "text", "created_at", "updated_at", "tracking_id") VALUES (?, ?, ?, ?, ?)  [["ministry", "Civil Aviation"], ["text", "ASFSAFSA"], ["created_at", "2015-10-31 01:17:10.162275"], ["updated_at", "2015-10-31 01:17:10.162275"], ["tracking_id", "18f8611bcd"]]
---
  def create
    @question = Question.new(question_params)
    if @question.valid?
      @question.save