app/controllers/questions_controller.rb

  def user
		question = Question.new

		if @question.blank?
			flash[:notice] = "Error! Please enter a valid question"
		end

		question.ministry = params[:ministry]
		question.text = params[:text]
		if !question.valid?
			flash[:notice] = []
			user.errors[:user].each do |e|
				flash[:notice].push(e)
			end
			redirect_to :controller => 'questions', :action => 'new'
		else
			question.save()
---
INSERT INTO "questions" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-10-31 02:58:23.107947"], ["updated_at", "2015-10-31 02:58:23.107947"]]